[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationForm.js:46:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.orgCode?.message}
-                    {errors.orgCode?.type === 'pattern' && 'Org code must be all uppercase'}
+                    {true && 'Org code must be all uppercase'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RestaurantForm tests that no Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Org code must be all uppercase</div> instead

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:53:49
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="translation">Organization Translation</Form.Label>
                 <Form.Control
-                    data-testid={testIdPrefix + "-translation"}
+                    data-testid={testIdPrefix + ""}
                     id="translation"
                     type="text"
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationForm-translation"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:57:34
                     id="translation"
                     type="text"
                     isInvalid={Boolean(errors.translation)}
-                    {...register("translation", {
+                    {...register("", {
                         required: "Org translation is required.",
                         maxLength : {
killedBy: RestaurantForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationForm.js:66:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.translation?.message}
+                    {errors.translation.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RestaurantForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:77:54
                     id="translationShort"
                     type="text"
                     isInvalid={Boolean(errors.translationShort)}
-                    {...register("translationShort", {
-                        required: "Short translation is required."
-                    })}
+                    {...register("translationShort", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Short translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationForm.js:82:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.translationShort?.message}
+                    {errors.translationShort.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RestaurantForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
