[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/menuItemReviews/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/menuItemReviews/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:38:9
             accessor: 'id', // accessor is the "key" in the data
         },
 
-        {
-            Header: 'ItemId',
-            accessor: 'itemId',
-        },
+        {},
         {
             Header: 'ReviewerEmail',
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:54:9
             Header: 'DateReviewed',
             accessor: 'dateReviewed',
         },
-        {
-            Header: 'Comments',
-            accessor: 'comments',
-        }
+        {}
     ];
 
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
