[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:33:18
 
         <Form onSubmit={handleSubmit(submitAction)}>
 
-                {initialContents && (
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">id</Form.Label>
-                            <Form.Control
-                                data-testid={testIdPrefix + "-id"}
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                )}
+                {false}
 
                 <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:70:51
                     id="reviewerEmail"
                     type="text"
                     isInvalid={Boolean(errors.itemId)}
-                    {...register("reviewerEmail", {
-                        required: "Reviewer email is required.",
-                    })}
+                    {...register("reviewerEmail", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:70:34
                     id="reviewerEmail"
                     type="text"
                     isInvalid={Boolean(errors.itemId)}
-                    {...register("reviewerEmail", {
+                    {...register("", {
                         required: "Reviewer email is required.",
                     })}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:71:35
                     type="text"
                     isInvalid={Boolean(errors.itemId)}
                     {...register("reviewerEmail", {
-                        required: "Reviewer email is required.",
+                        required: "",
                     })}
                     />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:86:43
                     id="stars"
                     type="text"
                     isInvalid={Boolean(errors.itemId)}
-                    {...register("stars", {
-                        required: "Stars are required.",
-                    })}
+                    {...register("stars", {})}
                     />
                     <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:105:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'Date reviewed is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date reviewed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:105:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'Date reviewed is required.'}
+                            {errors.dateReviewed || 'Date reviewed is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:116:46
                     id="comments"
                     type="text"
                     isInvalid={Boolean(errors.description)}
-                    {...register("comments", {
-                        required: "Comments are required."
-                    })}
+                    {...register("comments", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:117:35
                     type="text"
                     isInvalid={Boolean(errors.description)}
                     {...register("comments", {
-                        required: "Comments are required."
+                        required: ""
                     })}
                 />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
