[Killed] Regex
main/components/UCSBOrganizations/UCSBOrganizationForm.js:20:26
    
     const navigate = useNavigate();
 
-    const orgCodeRegex = /^[^a-z]*$/;
+    const orgCodeRegex = /[^a-z]*$/;
 
     const testIdPrefix = "UCSBOrganizationForm";
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org code must be all uppercase/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/UCSBOrganizations/UCSBOrganizationForm.js:20:26
    
     const navigate = useNavigate();
 
-    const orgCodeRegex = /^[^a-z]*$/;
+    const orgCodeRegex = /^[^a-z]$/;
 
     const testIdPrefix = "UCSBOrganizationForm";
killedBy: RestaurantForm tests that no Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:34:45
                     id="orgCode"
                     type="text"
                     isInvalid={Boolean(errors.orgCode)}
-                    {...register("orgCode", {
-                        required: "Org code is required.",
-                        maxLength: {
-                            value: 5,
-                            message: "Max length 5 characters"
-                        },
-                        pattern: orgCodeRegex
-                    })}
+                    {...register("orgCode", {})}
                     disabled={initialContents}
                 />
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:38:38
                         required: "Org code is required.",
                         maxLength: {
                             value: 5,
-                            message: "Max length 5 characters"
+                            message: ""
                         },
                         pattern: orgCodeRegex
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 5 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationForm.js:46:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.orgCode?.message}
-                    {errors.orgCode?.type === 'pattern' && 'Org code must be all uppercase'}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org code must be all uppercase/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationForm.js:46:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.orgCode?.message}
-                    {errors.orgCode?.type === 'pattern' && 'Org code must be all uppercase'}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org code must be all uppercase/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:57:52
                     id="orgTranslation"
                     type="text"
                     isInvalid={Boolean(errors.orgTranslation)}
-                    {...register("orgTranslation", {
-                        required: "Org translation is required.",
-                        maxLength : {
-                            value: 100,
-                            message: "Max length 100 characters"
-                        }
-                    })}
+                    {...register("orgTranslation", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Org translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:61:38
                         required: "Org translation is required.",
                         maxLength : {
                             value: 100,
-                            message: "Max length 100 characters"
+                            message: ""
                         }
                     })}
killedBy: RestaurantForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 100 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
